articles/leetcode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-19 Sat 14:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Leetcode</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">On Leetcode</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org22fbb3b">On Leetcode</a>
<ul>
<li><a href="#orgf16a154">Meritocratic Problem Solving</a></li>
<li><a href="#org6949df9">On Staying Sharp</a>
<ul>
<li><a href="#org8500972">You Are Not a Programmer</a></li>
<li><a href="#org8df6ebc">Thinking In Code</a></li>
<li><a href="#org5187ed1">Code Trust</a></li>
</ul>
</li>
<li><a href="#org2060db3">Beautiful Problems</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org22fbb3b" class="outline-1">
<h1 id="org22fbb3b">On Leetcode</h1>
<div class="outline-text-1" id="text-org22fbb3b">
<p>
I am a researcher, and as you might expect, I write fairly terrible code. In an attempt to keep myself sharp, I regularly code on leetcode.
</p>

<p>
<a href="https://leetcode.com/ambisinister/">My Leetcode Profile</a>
</p>
</div>

<div id="outline-container-orgf16a154" class="outline-2">
<h2 id="orgf16a154">Meritocratic Problem Solving</h2>
<div class="outline-text-2" id="text-orgf16a154">
<p>
All self-help content that has ever been published is either trying to run towards or away from one universal truth: you need to do things to get better at them. More to the point, you need to <i>work in a focused way</i> to <i>try to get better</i> at things. There are two ways you can deal with this immutable truth. First, you can get really good at pretending. This is what a lot of self-help is about, and for the most part represents the 10-minute-abs phenomenon. Second, you can cram a ton of effort into a short time. This is what "fast improvers" do.
</p>

<p>
A lot of people get the second part of this wrong. There's a great deal of people who have a misconception that improving at things is a function of how much time you spend at the thing. This is, at the surface level, true. How could it not be true? You start not knowing and then over time you know. But it raises a funny question: why do people improve at different rates? Is it because of innate talent? Is it because of "shortcuts" and hidden wisdom in the learning process?
</p>

<p>
The real revelation here is that time is just a container for effort, and that a lot of time is a very large container which can hold a lot of effort. There are some things where, to become good at them, you need to cram a monstrous amount of effort into that entire container, to fill it to the brim with a lifetime of excruciatingly high effort. Most things are not like that. Most things are things you can get pretty good at<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> with passive, moderate effort over a long period of time. You can learn these things very quickly if you're willing to be uncomfortable.
</p>

<p>
To be uncomfortable as much as possible, you need to fill your time with stuff that you struggle with, and remove stuff which is not that bad. For algorithms and data structures, leetcode offers a beautiful platform for most people who want to spend time finding stuff they suck at. Thousands of exercises, a gentle difficulty curve, community solutions for nearly every problem, labels for different types of problems, even detailed sets of problems commonly used for interviews. The path to go from complete beginner to someone with a strong handle on these things is contained entirely within this website, with virtually zero gatekeeping from knowledge or resource access. I know this because I have watched my wife, a biochemist with minimal programming background, grind problems on this platform until she could get through mediums with no assistance. 
</p>

<p>
The ultimate way to become strong at anything is to fill your time with exercises, ideally optimizing for as difficult and as many as possible. What counts as an exercise for the thing you want to learn is left to the reader, as an exercise.
</p>
</div>
</div>

<div id="outline-container-org6949df9" class="outline-2">
<h2 id="org6949df9">On Staying Sharp</h2>
<div class="outline-text-2" id="text-org6949df9">
<p>
Large Language Models are really amazing at generating code now. Like many other things, they have largely sped up the process of writing simple functions just by writing them in plain text<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. Even if you can write the solution yourself<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>, it's often simply faster to write what you want in english just because it's quicker to type it.
</p>

<p>
I find copilot-like tools to have improved my ability to produce code quickly. However, using these tools to write code does not really seem to help me become much better at it<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>. So I resolved to pay back some of the saved time deliberately grinding these sorts of simple problems, to make sure that I continue to improve at actually writing code without help<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>.
</p>

<blockquote class="twitter-tweet"><p lang="en" dir="ltr">I was learning Rust yesterday so I disabled it briefly to complete some coding exercises and I felt a sense of dread realizing it was just the cursor and I, alone in the text editor 😬</p>&mdash; Andrej Karpathy (@karpathy) <a href="https://twitter.com/karpathy/status/1608895190672211968?ref_src=twsrc%5Etfw">December 30, 2022</a></blockquote> <script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>

<p>
Given that code generation capabilities will only continue to improve, one might ask why we should bother to stay sharp anyways. To me, this question has three very simple answers: machine management, thinking in code, and trust.
</p>
</div>

<div id="outline-container-org8500972" class="outline-3">
<h3 id="org8500972">You Are Not a Programmer</h3>
<div class="outline-text-3" id="text-org8500972">
<p>
First, if you can't write code yourself and rely completely upon the LLM to generate code for you, you are not a programmer &#x2013; you are a manager. This is not to say your work is valueless (good and bad managers certainly exist), but if you cannot take the output of your LLM code generator and improve it to fit your actual specification, you are trapped just asking it to try again<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>. That is to say, what you can create is completely capped by the ability of the LLM to generate what you want<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>. At that point, you are not <i>writing the code faster using natural language</i>, you are <i>not writing any code</i>. It doesn't matter that there's code on the screen that almost does what you want. If you can't make it do what you want after the LLM spits it out, you are 0% of the way there.
</p>
</div>
</div>

<div id="outline-container-org8df6ebc" class="outline-3">
<h3 id="org8df6ebc">Thinking In Code</h3>
<div class="outline-text-3" id="text-org8df6ebc">
<p>
<i>Thinking in code</i> was the bulk of my motivation for staying sharp after LLMs took over a lot of my boilerplate tasks. If you <a href="https://www.youtube.com/watch?v=VHZDxOmRthE">reach leetcode enlightenment</a> and it becomes trivial for you to type up simple functions quickly, for sufficiently abstract tasks it becomes much harder to losslessly describe the desired output in natural language. It's a bit like trying to tell someone how to draw a picture: you can tell them what objects are in it, what art style it is in, what colors to use. But it won't be <i>the picture you are picturing</i> unless you get in there and do some of the drawing yourself first. Sometimes you just need it to be an apple, any apple, in any style. Other times you need a specific apple, in a specific orientation, and it's hard to use words.
</p>

<p>
What a lot of people miss is that <i>you can prompt with code</i>. At this point it begins to feel much more like pair programming &#x2013; you give it some code and ask it to <i>finish your code</i>, which allows for a much more straightforward problem-solving process compared to just asking for the entire project zero-shot.
</p>
</div>
</div>

<div id="outline-container-org5187ed1" class="outline-3">
<h3 id="org5187ed1">Code Trust</h3>
<div class="outline-text-3" id="text-org5187ed1">
<p>
Finally, trust is a big problem with LLM generated code. It's not too different from stack overflow copied code, in this way. It's tempting just to take the output and ship it if it passes your small handful of tests. Coming up with a suite of test cases to verify the intended behaviors is a huge part of writing code, and importantly also a huge part of leetcode, specifically.
</p>

<p>
I love to point to the <a href="http://www.devpsy.org/teaching/method/confirmation_bias.html">Wason 2-4-6 task</a> for this particular point: provided a sequence of number "2-4-6" which fits a rule, and a function which returns True or False if any sequence of 3 numbers solves the rule, try to uncover the rule. Most people will try "4-6-8" and then "10-12-14" and then conclude something like "even numbers going up by 2". But the real rule is just "three numbers ascending". You'll never uncover the rule unless you specifically seek out ways to <i>falsify</i> your hypothesis, which is at odds with your instinct to <i>confirm</i> your hypothesis.
</p>

<p>
With LLM code, you sometimes get code which appears to work. If you want to treat it like a black box and not do the legwork in understanding every line of code, you <i>at least</i> need to try to falsify the hypothesis that the code works, rather than confirming it.
</p>
</div>
</div>
</div>

<div id="outline-container-org2060db3" class="outline-2">
<h2 id="org2060db3">Beautiful Problems</h2>
<div class="outline-text-2" id="text-org2060db3">
<p>
Not all problems are created equal. Most of the problems on leetcode are pretty straightforward, even if they are sometimes very hard: identify what algorithms and data structures to use, transmute the problem to a problem you already know how to solve, and then solve it. Every once in a while, though, you encounter what I consider a <i>beautiful problem</i>.
</p>

<p>
One such problem is <a href="https://leetcode.com/problems/perfect-squares/">279. Perfect Squares</a>, which can be solved in 4 different ways: one using Dynamic Programming, Static DP, Breadth-First Search, or using math. When I tackled this problem, I wrote up a greedy solution, realized it would not always give me the correct answer, and relatively quickly wrote up a dynamic programming solution. I'd say I spent roughly ten minutes on it, in total: it was not too hard. As always, I thumbed through some solutions afterwards, and quickly realized that there were simply multiple ways to solve the problem in addition to what I did. I spent the next 30 minutes in a hyperfixated rabbit hole on wikipedia, reading about <a href="https://en.wikipedia.org/wiki/Lagrange%27s_four-square_theorem">Lagrange's four-square theorem</a>, far longer than I spent solving the original problem. This, to me, is the marker of a beautiful problem.
</p>

<p>
I never really had this sort of math background growing up, so encountering these sorts of weird theorems always comes as a wonderful little surprise to me whenver I happen upon them. I get the sense that these sorts of problems are more common in <a href="https://en.wikipedia.org/wiki/List_of_mathematics_competitions">contest math</a>, where solving them is less about applying a known formula<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup> and more about creatively arriving at some solution. While I understand the need to strengthen the ability to apply formulas (it's what pays the bills after all), this sort of thing is what makes me feel like the leetcode habit is worth it (as someone not currently looking to pass coding interviews). 
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Great essay on this front: <a href="https://danluu.com/p95-skill/">Dan Luu's "95th percentile isn't that good"</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I see a lot of disagreement over the usefulness of LLMs to generate code, and I think it mostly revolves around whether or not you do work which requires you to understand a very large codebase, which gpt4 is obviously hopeless at. I find it the most useful when I need some sort of simple black-box function, maybe on the scale of your typical leetcode problem. If 100% of your work is maintaining something huge I think it's very unlikely LLM based coding assistants are going to be helpful for you. I rarely do that these days! So for my projects it's been very very useful. Frankly speaking, if Karpathy finds value from something which can write 80% of code with 80% accuracy I think it would just be narcissism to believe I can't find any value in it.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Some may say <i>especially</i> if you can write the solution yourself. 
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I think it <i>does</i> often teach me new language features / new libraries I haven't heard of / etc, in the same way reading an editorial "makes me a better programmer".
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
That, and <a href="https://leetcode.com/mariawu2012/">my wife is also grinding leetcode</a> to learn data structures and algorithms for the first time, so I have to make sure I can explain the solutions well :)
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A horror story from someone I know who interviewed a potential new candidate: they tried to use copilot to pass a coding interview, and after unsuccessfully trying several prompts asked if it would be ok if they changed the requirement to match what copilot produced.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
More directly, problems which the LLM has already seen.
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
From my <a href="https://planetbanatt.net/articles/square1.html">Square-1 article</a>, "In the future I'm going to be more mindful of things that feel like puzzles, and things that feel like algorithms sheets" applies nicely here.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
